cucmv2/roles/CUCM_axl_setup/files/AxlCmds/AXL_addCommonDeviceConfig.txt

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns="http://www.cisco.com/AXL/API/11.5">
   <soapenv:Header/>
   <soapenv:Body>
      <ns:addCommonDeviceConfig sequence="?">
         <commonDeviceConfig>
            <name>Dual-Stack</name>
            <softkeyTemplateName uuid="?">Standard User</softkeyTemplateName>
            <ipAddressingMode>IPv4 and IPv6</ipAddressingMode>
            <ipAddressingModePreferenceControl>IPv4</ipAddressingModePreferenceControl>
            <replyMulticastEchoRequest>Default</replyMulticastEchoRequest>
         </commonDeviceConfig>
      </ns:addCommonDeviceConfig>
   </soapenv:Body>
</soapenv:Envelope>

